<?php

namespace application\extensions\geocoder;

class Gmt
{

    protected static $regionsGmt = [
        'Республика Адыгея' => 3,
        'Республика Алтай' => 6,
        'Республика Башкортостан' => 5,
        'Республика Бурятия' => 8,
        'Республика Дагестан' => 3,
        'Республика Ингушетия' => 3,
        'Республика Кабардино-Балкария' => 3,
        'Республика Калмыкия' => 3,
        'Республика Карачаево-Черкессия' => 3,
        'Республика Карелия' => 3,
        'Республика Коми' => 3,
        'Республика Марий Эл' => 3,
        'Республика Мордовия' => 3,
        'Республика Северная Осетия-Алания' => 3,
        'Республика Саха /Якутия/' => 10,
        'Республика Татарстан' => 3,
        'Республика Тыва' => 7,
        'Республика Удмуртия' => 4,
        'Республика Хакасия' => 7,
        'Республика Чечня' => 3,
        'Республика Чувашия' => 3,
        'Амурская область' => 9,
        'Иркутская область' => 8,
        'Калининградская область' => 2,
        'Камчатская область' => 12,
        'Кемеровская область' => 7,
        'Курганская область' => 5,
        'Магаданская область' => 11,
        'Новосибирская область' => 6,
        'Омская область' => 6,
        'Оренбургская область' => 5,
        'Пермская область' => 5,
        'Самарская область' => 4,
        'Сахалинская область' => 10,
        'Свердловская область' => 5,
        'Томская область' => 6,
        'Тюменская область' => 5,
        'Челябинская область' => 5,
        'Читинская область' => 9,
        'Алтайский край' => 6,
        'Красноярский край' => 7,
        'Приморский край' => 10,
        'Хабаровский край' => 10,
        'Еврейская автономная область' => 10,
        'Забайкальский край' => 9,
        'Пермский край' => 5,
        'Камчатский край' => 12,
        'Ханты-Мансийский автономный округ - Югра' => 5,
        'Ямало-Ненецкий' => 5,
    ];

    /**
     * 
     * @param string $region
     * @return int
     */
    public static function getMSKShiftTime($region)
    {
        return isset(self::$regionsGmt[$region])
            ? self::$regionsGmt[$region] - 3
            : 0;
    }

}